{"title":"GSoC with Servo - weeks 5 and 6","date":"2019-07-09T00:00:00.000Z","slug":"gsoc-with-servo-weeks-5-and-6","html":"\n<p>Last two weeks were really busy for me as I had my final exams and also moved to a new place for the summer.\nBut, fortunately, I've managed to get to an end with the <code>JSON</code> clone algorithm implementation and can return to working on improving and writing WebDriver commands.</p>\n<p>Besides the previously existing support for returning primitive JavaScript types from <code>ExecuteScript</code> and <code>ExecuteAsyncScript</code>, I added support for returning\n<a href=\"https://w3c.github.io/webdriver/#dfn-collection\">collections</a>, <a href=\"https://dom.spec.whatwg.org/#concept-element\">web elements</a>,\n<a href=\"https://html.spec.whatwg.org/#windowproxy\">window proxies</a> and objects having a <code>toJSON</code> function property, as per the WebDriver <a href=\"https://w3c.github.io/webdriver/#dfn-json-clone\">specification</a>.\nCurrently, only <a href=\"https://github.com/servo/servo/pull/23725\"><code>collections support</code></a> is pushed on the Servo's GitHub repository in order to keep the changes easy for review,\nbut I will progressively push the rest of the changes once the pending pull request is merged into the <code>master</code> branch.</p>\n<p>Support for returning objects is still missing. I really wanted to have a full implementation of the <code>JSON</code> clone algorithm, but I decided that it's better to focus on\nother things since supporting returning objects requires some additional work that would take a good amount of time.\nAnyway, I'll keep this in mind and save the work I've done on it for some time in the near future.</p>\n<p>As part of last weeks' work, I also improved the implementation of\n<a href=\"https://github.com/servo/servo/blob/d0bd2d5e44d4006b00ef53f351945d01e1c8458d/components/script/dom/bindings/conversions.rs#L556\"><code>is_array_like</code></a> by providing support\nfor the collection types needed by the <code>JSON</code> clone algorithm. The improvements can be found <a href=\"https://github.com/servo/servo/pull/23669\">here</a>,</p>\n<p>I can say that these last two weeks were the most challenging so far, but also the most rewarding. I've really enjoyed working on low-level <a href=\"https://doc.servo.org/mozjs/\"><code>mozjs</code></a> stuff.\nIt was an awesome learning experience and it definitely deepened my understanding of the interactions that occur within the browser's backend.</p>\n<p>This week I'm planning to investigate the failing tests issue in <a href=\"https://github.com/servo/servo/pull/23585\">this</a> pull request, return to working on missing WebDriver commands\n(<a href=\"https://w3c.github.io/webdriver/#get-element-property\"><code>GetElementProperty</code></a> for example), add support for more <a href=\"https://w3c.github.io/webdriver/#locator-strategies\">locator strategies</a>\nfor finding elements and, hopefully, get the changes from the last two weeks merged into the main branch.</p>\n"}