{"title":"GSoC with Servo - week 1","date":"2019-06-04T00:00:00.000Z","slug":"gsoc-with-servo-week-1","html":"\n<p>For Google Summer of Code 2019, I'm working on improving WebDriver support in Servo.\nThe details of the project can be found <a href=\"https://summerofcode.withgoogle.com/dashboard/project/5248302524661760/details/\">here</a>.</p>\n<p>In the first week of the coding period I managed to fix both of the issues related to creating new WebDriver sessions during testing.</p>\n<p>The current WebDriver implementation doesn't support multiple concurrent sessions.\nTrying to create a new session while another one is still active results in a <code>Session is already started</code> error.\nThis is exactly the <a href=\"https://github.com/servo/servo/issues/22619\">error</a> we were intermittently getting when running the automated WebBluetooth tests and the error we were always getting\nwhen running the <code>wdspec</code> <a href=\"https://github.com/servo/servo/tree/master/tests/wpt/web-platform-tests/webdriver/tests/new_session\"><code>new_session</code></a> tests.\nNote that both of these tests are parallelized.</p>\n<p>While investigating what might possibly cause the error in the WebBluetooth tests, I noticed that whenever it occured,\nthe <a href=\"https://github.com/servo/servo/tree/master/tests/wpt/web-platform-tests/tools/wptrunner/wptrunner\">wptrunner</a> test runner strangely assigned the same port to different instances of WebDriver.\nHaving several processes trying to create a new session on the same port was the cause of the error.\nIt seemed that there was a data race when assigning ports for the WebDriver instances.\nI solved this by <a href=\"https://github.com/web-platform-tests/wpt/pull/16819\">protecting</a> the retrieval of a free port with a lock.</p>\n<p>But it seemed that this was not enough.\nThe <code>new_session</code> tests were still failing due to the same error.\nAs I fully described <a href=\"https://github.com/servo/servo/issues/22619#issuecomment-496270969\">here</a>, this was happening because for the <code>wdspec</code> tests,\nthe port retrieval was not done in different threads, as for the WebBluetooth tests, but in different processes.\nEach process had a different copy of the state needed to safely retrieve a free port and the changes made by one process to it were not reflected in the other processes.\nThis time, the <a href=\"https://github.com/web-platform-tests/wpt/pull/17047\">solution</a> was to switch to random OS port retrieval by always binding to port <code>0</code>.\nAlthough this is still prone to data races, it was the easiest solution, as sharing state between different processes is not trivial to do.</p>\n<p>Once I got these issues fixed, I focused on implementing the <a href=\"https://w3c.github.io/webdriver/#new-session-0\">w3c specification</a> for the <code>New Session</code> command.\nAs a result of this, the majority of the associated <code>wdspec</code> tests are now passing.</p>\n<p>I also started to check the status of the whole <code>wdspec</code> test suite.\nUnsurprisingly, there are lots of errors and failures.\nHowever, I found a common error in the majority of the tests and that's what I'm going to focus on next.</p>\n<p>It was a great first week! I learned a lot about concurrency and realized how hard it is to write programs that are both safe and concurrent.</p>\n"}