{"title":"GSoC with Servo - week 3","date":"2019-06-17T00:00:00.000Z","slug":"gsoc-with-servo-week-3","html":"\n<p>Last week the first big project milestone was achieved! The <code>wdspec</code> tests are now <a href=\"https://github.com/servo/servo/pull/23570\">enabled</a> in Servo!</p>\n<p>My first approach at this was to enable the tests one by one, together with small fixes in the associated commands' implementation.\nAt first, this went pretty well. I started by enabling <code>get_title</code>, <code>get_current_url</code> and all cookie related tests.\nHowever, enabling <code>find_element</code> and related tests raised some issues.</p>\n<p>The test suites of commands related to finding elements contain lots of tests, a lot more than most of the other commands.\nSince they couldn't complete in the <code>30</code> seconds default timeout threshold in <code>wptrunner</code>, the tests were ended prematurely and were wrongly reported as timed out.\nOne solution I considered was passing a <code>--timeout-multiplier=4</code> argument to the test runner job in the CI server.\nWith it, the timeout threshold would get a fourfold increase, from <code>30</code> seconds to two minutes.\nThis, however, would have unnecessarily increased the testing time since the <code>wdspec</code> tests are ran together with the majority of the <code>wpt</code> tests and\nthe increased timeout would have also been reflected in all these other tests.</p>\n<p>As suggested <a href=\"https://github.com/servo/servo/pull/23550#issuecomment-501745411\">here</a>, the best way to overcome this issue was by running a different job only for <code>wdspec</code> tests.\nThis way, the increased timeout would only be reflected in the <code>wdspec</code> tests and the other tests would be run in the same way as before.\nNow, all <code>wdspec</code> tests needed to be enabled at once because the changes in <a href=\"https://github.com/servo/servo/blob/master/tests/wpt/include.ini\"><code>include.ini</code></a>,\nthe file where different test suites can be enabled or disabled, are only reflected when running the whole <code>wpt</code> test suite, not just a part of it as was the case with the <code>wdspec</code> tests.</p>\n<p>Once the tests were enabled I started working on implementing some missing commands (<a href=\"https://w3c.github.io/webdriver/#switch-to-window\"><code>SwitchToWindow</code></a> and\n<a href=\"https://w3c.github.io/webdriver/#dismiss-alert\"><code>DismissAlert</code></a>) that were polluting the test runner output with <code>Command not implemented</code> errors.</p>\n<p>During the weekend I worked on the <a href=\"https://w3c.github.io/webdriver/#get-page-source\"><code>GetPageSource</code></a> command and today I finished implementing the <code>tag name</code> selector strategy\nfor <code>FindElement</code> and related commands.</p>\n<p>It was great week, very productive in terms of results! Now that the <code>wdspec</code> tests are enabled, the infrastructure for testing the current WebDriver implementation\nand for implementing the missing commands is all set up.</p>\n<p>This week I'm going to continue working on implementing new WebDriver commands and on providing fixes where necessary in the existing implementation.</p>\n"}