{"title":"GSoC with Servo - weeks 7 and 8","date":"2019-07-23T00:00:00.000Z","slug":"gsoc-with-servo-weeks-7-and-8","html":"\n<p>Two more weeks have passed and things are slowly and surely improving.</p>\n<p>In the beginning of the seventh week I investigated why the <a href=\"https://github.com/servo/servo/pull/23585\"><code>tag name</code> selector PR</a> was failing the tests, given that these\nwere passed when run locally.\nThe issue seemed to be a missing <code>HOST_FILE</code> environment variable, which provides mappings from the hostnames used by the HTTP testing server to appropriate IP addresses.\nThis was an easy fix, as the needed file already <a href=\"https://github.com/servo/servo/blob/master/tests/wpt/hosts\">existed</a> in the codebase.\nHowever, since this issue affected all the tests that were dependent on the HTTP testing server, the fix for it caused a lot of unexpected tests results.\nMost of them were unexpected passes, but a few were unexpected\n<a href=\"https://build.servo.org/builders/linux-rel-wpt/builds/12913/steps/shell__5/logs/filtered-wdspec-errorsummary.log\">errors occurring at the setup stage</a>, that is before the actual tests are actually run.</p>\n<p>Basically, when reaching <a href=\"https://github.com/servo/servo/blob/4470035f7540602a011b87ec25f4cbb39194c7d5/tests/wpt/web-platform-tests/webdriver/tests/support/fixtures.py#L156\">this</a> line,\nthe session, which is explicitly checked to exist a few lines before, is inexistent.\nI spent some good time trying to figure out why this strange anomaly occurred.</p>\n<p>The issue was caused by the <a href=\"https://github.com/servo/servo/blob/master/tests/wpt/web-platform-tests/webdriver/tests/delete_session/delete.py\"><code>delete_session</code></a> tests, which somehow\n<a href=\"https://github.com/servo/servo/blob/4470035f7540602a011b87ec25f4cbb39194c7d5/tests/wpt/web-platform-tests/webdriver/tests/delete_session/delete.py#L19\">end</a> the current session without\nnotifying the test harness of it. Thus, we are left with the id of a previous session, which the test harness interprets as a valid session, although in reality\nthere is no existing session. Trying to execute commands on a session-less WebDriver instance triggers the <code>Session not created</code> errors, as in the described issue.</p>\n<p>As a quick fix for this I simply disabled the tests for <code>DeleteSession</code>. This issue already took a lot of time to fix so I'll come back to figuring out exactly how it happens and fixing\nit later when more time is available.</p>\n<p>These weeks, I also <a href=\"https://github.com/servo/servo/pull/23805\">started</a> to work on implementing support for <a href=\"https://w3c.github.io/webdriver/#actions\">actions</a> and the associated\n<a href=\"https://w3c.github.io/webdriver/#perform-actions\"><code>PerformActions</code></a> and <a href=\"https://w3c.github.io/webdriver/#release-actions\"><code>ReleaseActions</code></a> commands.\nI already have a working version which supports the <code>pause</code>, <code>keyUp</code> and <code>keyDown</code> actions, but it needs to be polished a bit before it's ready for production.</p>\n<p>One unfortunate thing with the <code>PerformActions</code> and <code>ReleaseActions</code> commands is that their associated <code>wpt</code> tests all have dependencies on other WebDriver commands, some of them not\nbeing yet implemented in Servo. So, most of the tests fail due to this, and the only way to check the implementation is by manually testing it.\nOne available option, though, is to write tests that are independent of other commands.</p>\n<p>Besides these, I also finished implementing <a href=\"https://w3c.github.io/webdriver/#get-element-property\"><code>GetElementProperty</code></a> and <a href=\"https://w3c.github.io/webdriver/#link-text\"><code>link text</code></a>\nand <a href=\"https://w3c.github.io/webdriver/#partial-link-text\"><code>partial link text</code></a> selectors for <code>FindElement</code> and related commands. The PRs for these can be found\n<a href=\"https://github.com/servo/servo/pull/23820\">here</a> and <a href=\"https://github.com/servo/servo/pull/23745\">here</a>.</p>\n<p>These two weeks have been very productive. A lot of existing PRs are being finalized and the whole implementation is getting better, more stable and more compliant.</p>\n<p>Next, I will be mainly focusing on adding further support for the <a href=\"https://w3c.github.io/webdriver/#actions\">actions</a> and <a href=\"https://w3c.github.io/webdriver/#interaction\">interaction</a> commands,\nas well as getting to an end with the support for returning arrays and arbitrary objects from WebDriver.</p>\n"}